bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
  ret = aci_gatt_update_char_value(HWServW2STHandle, AccEventCharHandle, 0u, 2u + 2u, buff);
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating AccEvent_Notify Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating AccEvent_Notify Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}

/**
 * @brief  Add the HW Features service using a vendor specific profile
 * @param  None
 * @retval tBleStatus Status
 */
tBleStatus Add_HWServW2ST_Service(void)
{
  tBleStatus ret;
  uint8_t NumberChars = 5u;

  uint8_t uuid[16];

#ifdef STM32_SENSORTILE
  if(TargetBoardFeatures.HandleGGComponent){
    /* Battery Present */
    NumberChars++;
  }
#endif /* STM32_SENSORTILE */

  COPY_HW_SENS_W2ST_SERVICE_UUID(uuid);
  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE,
                          1u + (3u * NumberChars),
                          &HWServW2STHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  /* Fill the Environmental BLE Characteristc */
  COPY_ENVIRONMENTAL_W2ST_CHAR_UUID(uuid);
#if 0
    /* Fill the Battery and Environmental BLE Characteristc */
    if (TargetBoardFeatures.NumTempSensors == 2) {
      uuid[14] |= 0x05u; /* Two Temperature values*/
      EnvironmentalCharSize += 2u * 2u;
    } else if (TargetBoardFeatures.NumTempSensors == 1) {
      uuid[14] |= 0x04u; /* One Temperature value*/
     EnvironmentalCharSize += 2u;
    }
#endif
  
    uuid[14] |= 0x05u; /* Two Temperature values*/
    EnvironmentalCharSize += 2u * 2u;
  
   uuid[14] |= 0x08u; /* Battery level (percentage of full battery) */
   EnvironmentalCharSize += 2u;
 
    uuid[14] |= 0x10u; /* Pressure value*/
    EnvironmentalCharSize += 4u;
  
  ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 2u + 4u + 2u + 2u + 2u,
                           CHAR_PROP_NOTIFY|CHAR_PROP_READ,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 0, &EnvironmentalCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_ACC_GYRO_MAG_W2ST_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 2u + (3u * 3u * 2u),
                           CHAR_PROP_NOTIFY,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 0, &AccGyroMagCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_ACC_EVENT_W2ST_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 2u + 2u,
                           CHAR_PROP_NOTIFY | CHAR_PROP_READ,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 0, &AccEventCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

  COPY_ARMING_W2ST_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 2u + 1u,
                           CHAR_PROP_NOTIFY | CHAR_PROP_READ,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 0, &ArmingCharHandle);

  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }

#ifdef STM32_SENSORTILE
  if(TargetBoardFeatures.HandleGGComponent){
    COPY_GG_W2ST_CHAR_UUID(uuid);
    ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 2u + 2u + 2u + 2u + 1u,
                             CHAR_PROP_NOTIFY | CHAR_PROP_READ,
                             ATTR_PERMISSION_NONE,
                             GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                             16, 0, &GGCharHandle);

    if (ret != BLE_STATUS_SUCCESS) {
      goto fail;
    }
  }
#endif /* STM32_SENSORTILE */
	
	
	/* MAX charecteristic */
	COPY_MAX_W2ST_CHAR_UUID(uuid);
  ret =  aci_gatt_add_char(HWServW2STHandle, UUID_TYPE_128, uuid, 7u,
                          CHAR_PROP_WRITE_WITHOUT_RESP | CHAR_PROP_WRITE,
                           ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_ATTRIBUTE_WRITE,
                           16, 0, &MaxCharHandle);
	
  if (ret != BLE_STATUS_SUCCESS) {
    goto fail;
  }
	

  return BLE_STATUS_SUCCESS;

fail:
  return BLE_STATUS_ERROR;
}

/**
 * @brief  Update acceleration/Gryoscope and Magneto characteristics value
 * @param  SensorAxes_t Acc Structure containing acceleration value in mg
 * @param  SensorAxes_t Gyro Structure containing Gyroscope value
 * @param  SensorAxes_t Mag Structure containing magneto value
 * @retval tBleStatus      Status
 */
tBleStatus AccGyroMag_Update(SensorAxes_t *Acc,SensorAxes_t *Gyro,SensorAxes_t *Mag)
{  
  tBleStatus ret;

  uint8_t buff[2 + (3 * 3 * 2)];

  STORE_LE_16(buff, (HAL_GetTick() >> 3));
  
  STORE_LE_16(buff + 2, Acc->AXIS_X);
  STORE_LE_16(buff + 4, Acc->AXIS_Y);
  STORE_LE_16(buff + 6, Acc->AXIS_Z);
  
  Gyro->AXIS_X /= 100;
  Gyro->AXIS_Y /= 100;
  Gyro->AXIS_Z /= 100;

  STORE_LE_16(buff + 8 , Gyro->AXIS_X);
  STORE_LE_16(buff + 10, Gyro->AXIS_Y);
  STORE_LE_16(buff + 12, Gyro->AXIS_Z);

  STORE_LE_16(buff + 14, Mag->AXIS_X);
  STORE_LE_16(buff + 16, Mag->AXIS_Y);
  STORE_LE_16(buff + 18, Mag->AXIS_Z);
  
  ret = ACI_GATT_UPDATE_CHAR_VALUE(HWServW2STHandle, AccGyroMagCharHandle, 0u, 2u + (3u * 3u * 2u), buff);
	
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Acc/Gyro/Mag Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating Acc/Gyro/Mag Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}

/**
 * @brief  Update Battery, Environmental and RSSI characteristic value
 * @param  float32_t Press Pressure in mbar
 * @param  uint16_t Batt Battery level as percetange of full battery
 * @param  int16_t Temp Temperature in tenths of degree second sensor
 * @param  int16_t RSSI level in dB
 * @retval tBleStatus   Status
 */
tBleStatus Batt_Env_RSSI_Update(int32_t Press,uint16_t Batt,int16_t Temp,int16_t RSSI)
{
  tBleStatus ret;
  uint8_t BuffPos;
  
