bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
  uint8_t buff[2 + 4 /*Press*/ + 2 /*Batt*/ + 2 /*Temp*/ + 2 /*RSSI*/ ];

  STORE_LE_16(buff, (HAL_GetTick() >> 3));
  BuffPos = 2u;
  
  STORE_LE_32(buff + BuffPos, Press);
  BuffPos += 4u;
  
  STORE_LE_16(buff + BuffPos, Batt);
  BuffPos += 2u;
 
  STORE_LE_16(buff + BuffPos, Temp);
  BuffPos += 2u;

  STORE_LE_16(buff + BuffPos, RSSI);
  // BuffPos += 2u;
  
  ret = aci_gatt_update_char_value(HWServW2STHandle, EnvironmentalCharHandle, 0u, 2u + 4u + 2u + 2u + 2u, buff);
  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Environmental Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating Environmental Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}



/**
 * @brief  Update ARMING characteristic value
 * @param  uint8_t ArmingStatus Arming status 0/1 (off/on)
 * @retval tBleStatus   Status
 */
tBleStatus ARMING_Update(uint8_t ArmingStatus)
{
  tBleStatus ret;

  uint8_t buff[2 + 1];

  STORE_LE_16(buff, (HAL_GetTick() >> 3));
  buff[2] = ArmingStatus;

  ret = aci_gatt_update_char_value(HWServW2STHandle, ArmingCharHandle, 0u, 2u + 1u, buff);

  if (ret != BLE_STATUS_SUCCESS) {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating ARMING Char\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Error Updating Temp Char\r\n");
    }
    ret = BLE_STATUS_ERROR;
  }
  return ret;
}


/**
 * @brief  Puts the device in connectable mode.
 * @param  None 
 * @retval None
 */
void setConnectable(void)
{  
  char local_name[8] = {AD_TYPE_COMPLETE_LOCAL_NAME, NAME_DRN};
  uint8_t manuf_data[26] = {
    2u, 0x0Au, 0x00u /* 0 dBm */, // Trasmission Power
    8u, 0x09u, NAME_DRN, // Complete Name
    13u, 0xFFu, 0x01u /*SKD version */,
    0x80u,
    0x00u, /* */
    0xE0u, /* ACC+Gyro+Mag*/
    0x00u, /*  */
    0x00u, /*  */
    0x00u, /* BLE MAC start */
    0x00u,
    0x00u,
    0x00u,
    0x00u,
    0x00u, /* BLE MAC stop */
  };

  /* BLE MAC */
  manuf_data[20] = bdaddr[5];
  manuf_data[21] = bdaddr[4];
  manuf_data[22] = bdaddr[3];
  manuf_data[23] = bdaddr[2];
  manuf_data[24] = bdaddr[1];
  manuf_data[25] = bdaddr[0];

  manuf_data[16] |= 0x20u; /* Led */
  manuf_data[17] |= 0x05u; /* Temperature and RSSI values*/
  manuf_data[17] |= 0x08u; /* Battery level (percentage of full battery) */
  manuf_data[17] |= 0x10u; /* Pressure value*/
    
  /* Max Char */
  manuf_data[18] |=0x80u;

  /* disable scan response */
  (void)hci_le_set_scan_resp_data(0u, NULL);
  (void)aci_gap_set_discoverable(ADV_IND, 0u, 0u,
#ifndef MAC_MOTENV
  #ifdef MAC_STM32UID_MOTENV
                           STATIC_RANDOM_ADDR,
  #else /* MAC_STM32UID_MOTENV */
                           RANDOM_ADDR,
  #endif /* MAC_STM32UID_MOTENV */
#else /* MAC_BLUEMS */  
                           PUBLIC_ADDR,  
#endif /* MAC_MOTENV */
                           NO_WHITE_LIST_USE,
                           sizeof(local_name), local_name, 0, NULL, 0, 0);

  /* Send Advertising data */
  (void)aci_gap_update_adv_data(26u, manuf_data);
}

/**
 * @brief  This function is called when there is a LE Connection Complete event.
 * @param  uint8_t addr[6] Address of peer device
 * @param  uint16_t handle Connection handle
 * @retval None
 */
static void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle)
{  
  connected = TRUE;
  connection_handle = handle;

#ifdef MOTENV_DEBUG_CONNECTION
  PRINTF(">>>>>>CONNECTED %x:%x:%x:%x:%x:%x\r\n", addr[5], addr[4], addr[3], addr[2], addr[1], addr[0]);
#endif /* MOTENV_DEBUG_CONNECTION */

  ConnectionBleStatus = 0;
  
  if (0 != TargetBoardFeatures.HWAdvanceFeatures) {
    DisableHWFeatures();
  }
  
  (void) aci_l2cap_connection_parameter_update_request(connection_handle,
                                                      10 /* interval_min*/,
                                                      10 /* interval_max */,
                                                      0   /* slave_latency */,
                                                      400 /*timeout_multiplier*/);
}

/**
 * @brief  This function is called when the peer device get disconnected.
 * @param  None 
 * @retval None
 */
static void GAP_DisconnectionComplete_CB(void)
{
  connected = FALSE;

#ifdef MOTENV_DEBUG_CONNECTION  
  PRINTF("<<<<<<DISCONNECTED\r\n");
#endif /* MOTENV_DEBUG_CONNECTION */  

  /* Make the device connectable again. */
  set_connectable = TRUE;

  ConnectionBleStatus = 0;
  
  if (0 != TargetBoardFeatures.HWAdvanceFeatures) {
    DisableHWFeatures();
  }
}

/**
 * @brief  This function is called when there is a Bluetooth Read request
 * @param  uint16_t handle Handle of the attribute
 * @retval None
 */
extern void Read_Request_CB(uint16_t handle);
void Read_Request_CB(uint16_t handle)
{
  uint8_t Status;  
  if (handle == (EnvironmentalCharHandle + 1u)) {
    /* Read Request for Pressure,Battery, and Temperatures*/
    float32_t SensorValue;
    int32_t PressToSend = 0;
    uint16_t BattToSend = 0u;
    int16_t TempToSend = 0, RSSIToSend = 0;
    int32_t decPart, intPart;
    if (NULL != TargetBoardFeatures.HandlePressSensor) {
      if (((0u != TargetBoardFeatures.SnsAltFunc) ? BSP_PRESSURE_IsInitialized : BSP_PRESSURE_IsInitialized)(TargetBoardFeatures.HandlePressSensor, &Status) == COMPONENT_OK) {
        (void) ((0u != TargetBoardFeatures.SnsAltFunc) ? BSP_PRESSURE_Get_Press : BSP_PRESSURE_Get_Press)(TargetBoardFeatures.HandlePressSensor, (float32_t *)&SensorValue);
        MCR_BLUEMS_F2I_2D(SensorValue, intPart, decPart);
        PressToSend = (intPart * 100) + decPart;
      }
    }

    (void) Batt_Env_RSSI_Update(PressToSend, BattToSend, TempToSend, RSSIToSend);
  } else if (handle == (ArmingCharHandle + 1u)) {
    /* Read Request for Arming Status */
	  (void) ARMING_Update(TargetBoardFeatures.LedStatus);
  } else if (handle == (AccEventCharHandle + 1u)) {
    
  } else if (handle == (StdErrCharHandle + 1u)) {
    /* Send again the last packet for StdError */
	  (void) Stderr_Update_AfterRead();
  } else if (handle == (TermCharHandle + 1u)) {
    /* Send again the last packet for Terminal */
	  (void) Term_Update_AfterRead();
#ifdef STM32_SENSORTILE
  } else if (handle == (GGCharHandle + 1u)) {
    GG_Update();
#endif /* STM32_SENSORTILE */
  } else {
  	// nothing to do - MISRAC2012-RULE_15_7-a
  }

  //EXIT:
  if (connection_handle != 0u) {
	  (void) aci_gatt_allow_read(connection_handle);
  }
}

/**
 * @brief  This function is called when there is a change on the gatt attribute
 * With this function it's possible to understand if one application 
 * is subscribed or not to the one service
 * @param uint16_t att_handle Handle of the attribute
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval None
 */
extern void Attribute_Modified_CB(uint16_t attr_handle, uint8_t * att_data, uint8_t data_length) ;
void Attribute_Modified_CB(uint16_t attr_handle, uint8_t * att_data, uint8_t data_length) 
{
  if (attr_handle == (ConfigCharHandle + 2u)) {
    ;/* do nothing... only for removing the message "Notification UNKNOW handle" */
  } else if(attr_handle == (StdErrCharHandle + 2u)) {
    if (att_data[0] == 1u) {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_ERR);
    } else if (att_data[0] == 0u) {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_ERR);
    } else {
    	// nothing to do - MISRAC2012-RULE_15_7-a
    }
  } else if(attr_handle == (TermCharHandle + 2u)) {
    if (att_data[0] == 1u) {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_TERM);
    } else if (att_data[0] == 0u) {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_TERM);
    } else {
    	// nothing to do - MISRAC2012-RULE_15_7-a
    }
  } else if (attr_handle == (TermCharHandle + 1u)) {
    uint32_t SendBackData = 1u; /* By default Answer with the same message received */
    {
      /* Received one write from Client on Terminal characteristics */
      SendBackData = DebugConsoleCommandParsing(att_data,data_length);
    }

    /* Send it back for testing */
    if (0u != SendBackData) {
    	(void) Term_Update(att_data, data_length);
    }
  } else if (attr_handle == (ArmingCharHandle + 2u)) {
    if (att_data[0] == 1u) {
      W2ST_ON_CONNECTION(W2ST_CONNECT_LED);
      /* Update the LED feature */
      (void) ARMING_Update(TargetBoardFeatures.LedStatus);
    } else if (att_data[0] == 0u) {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_LED);
    } else {
    	// nothing to do - MISRAC2012-RULE_15_7-a
    }
#ifdef MOTENV_DEBUG_CONNECTION
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "--->Led=%s\r\n", (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_LED)) ? "ON" : "OFF");
      (void) Term_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("--->Led=%s\r\n", (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_LED)) ? "ON" : "OFF");
    }
#endif /* MOTENV_DEBUG_CONNECTION */
  } else if (attr_handle == (ConfigCharHandle + 1u)) {
    /* Received one write command from Client on Configuration characteristc */
	  (void) ConfigCommandParsing(att_data, data_length);
  } else if (attr_handle == (MaxCharHandle + 1u)) {
     joydata[0] = att_data[1];
     joydata[1] = att_data[2];
     joydata[2] = att_data[3];
     joydata[3] = att_data[4];
     joydata[4] = att_data[5];
     joydata[5] = att_data[6];
     joydata[6] = att_data[7];
     joydata[7] = att_data[8];
  } else {
    if (0 != W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)) {
      BytesToWrite = sprintf((char *)BufferToWrite, "Notification UNKNOWN handle\r\n");
      (void) Stderr_Update(BufferToWrite, BytesToWrite);
    } else {
      PRINTF("Notification UNKNOWN handle\r\n");
    }
  }
}

/**
 * @brief  This function makes the parsing of the Debug Console Commands
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval uint32_t SendItBack true/false
 */
static uint32_t DebugConsoleCommandParsing(uint8_t * att_data, uint8_t data_length)
{
  uint32_t SendBackData = 1;

  if ((att_data[0] == '?') && (att_data[1] == '?')) {
    /* Print Legend */
    SendBackData = 0u;

