bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
        switch(att_data[2]) {
          case 'L':
            loc_att_data[5] = 50u; /* @5S */
          break;
          case 'M':
            loc_att_data[5] = 10u; /* @1S */
          break;
          case 'H':
            loc_att_data[5] = 1u; /* @100mS */
          break;
          case 'D':
            loc_att_data[5] = 0u; /* Default */
          break;
          default:
        	/* no action needed here */
        	break;
        }
        SendBackData = ConfigCommandParsing(loc_att_data, loc_data_length);
      } else {
      	// nothing to do - MISRAC2012-RULE_15_7-a
      }
    }
  }
#endif
  return SendBackData;
}

/**
 * @brief  This function makes the parsing of the Configuration Commands
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval uint32_t SendItBack true/false
 */
static uint32_t ConfigCommandParsing(const uint8_t * att_data, uint8_t data_length)
{
  uint32_t SendItBack = 1u;
  return SendItBack;
}

/**
 * @brief  This function is called whenever there is an ACI event to be processed.
 * @note   Inside this function each event must be identified and correctly
 *         parsed.
 * @param  void *pckt Pointer to the ACI packet
 * @retval None
 */
void HCI_Event_CB(void *pckt)
{
  hci_uart_pckt *hci_pckt = pckt;
  hci_event_pckt *event_pckt = (hci_event_pckt*) hci_pckt->data;
  
  if (hci_pckt->type == HCI_EVENT_PKT) {
	  switch (event_pckt->evt) {
	  case EVT_DISCONN_COMPLETE:
	    {
	      GAP_DisconnectionComplete_CB();
	    }
	    break;
	  case EVT_LE_META_EVENT:
	    {
	      evt_le_meta_event *evt = (void *)event_pckt->data;
	      if (EVT_LE_CONN_COMPLETE == evt->subevent) {
	          evt_le_connection_complete *cc = (void *)evt->data;
	          GAP_ConnectionComplete_CB(cc->peer_bdaddr, cc->handle);
	      }
	    }
	    break;
	  case EVT_VENDOR:
	    {
	      evt_blue_aci *blue_evt = (void*)event_pckt->data;
	      switch (blue_evt->ecode){
	      case EVT_BLUE_GATT_READ_PERMIT_REQ:
	        {
	          evt_gatt_read_permit_req *pr = (void*)blue_evt->data;
	          Read_Request_CB(pr->attr_handle);
	        }
	        break;
	      case EVT_BLUE_GATT_ATTRIBUTE_MODIFIED:
	        if (TargetBoardFeatures.bnrg_expansion_board == IDB05A1) {
	              evt_gatt_attr_modified_IDB05A1 *evt = (evt_gatt_attr_modified_IDB05A1*)blue_evt->data;
	              Attribute_Modified_CB(evt->attr_handle, evt->att_data,evt->data_length);
	            } else {
	              evt_gatt_attr_modified_IDB04A1 *evt = (evt_gatt_attr_modified_IDB04A1*)blue_evt->data;
	              Attribute_Modified_CB(evt->attr_handle, evt->att_data,evt->data_length);
	            }
	        break;
	      default:
	    	  /* no action needed here */
	    	break;
	      }
	    }
	    break;
	    default:
		/* no action needed here */
		break;
	  }
  }
}


static void DisableHWFeatures(void)
{  
}


/******************* (C) COPYRIGHT 2016 STMicroelectronics *****END OF FILE****/
